[
    {
        "title": "Django Unchained",
        "imbdRate": "8.4 / 10",
        "imgSrc": "https://m.media-amazon.com/images/M/MV5BMjIyNTQ5NjQ1OV5BMl5BanBnXkFtZTcwODg1MDU4OA@@._V1_.jpg",
        "spoiler": "Django (Jamie Foxx) is freed from slavery by a German bounty hunter (Christoph Waltz). Together they kill the men who had sold Django and his wife to separate slave traders."
    },
    {
        "title": "The Good, the Bad and the Ugly",
        "imbdRate": "8.8 / 10",
        "imgSrc": "https://m.media-amazon.com/images/M/MV5BNjJlYmNkZGItM2NhYy00MjlmLTk5NmQtNjg1NmM2ODU4OTMwXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
        "spoiler": "The ending of The Good, the Bad, and the Ugly culminates in one of film history's greatest gun duels. Before reaching the cemetery, the eponymous characters have teamed up and double-crossed each other beyond all reason, and only Blondie knows what grave hides the gold. All three men supposedly want the money for themselves. To determine who walks away rich, Blondie writes the name of the grave on a rock and the three prepare for the shootout of a lifetime. Only two men are left standing with their shares of the gold at the end of the film, but only one rides away with a smile on his face."
    },
    {
        "title": "Once Upon a Time in the West",
        "imbdRate": "7.6 / 10",
        "imgSrc": "https://m.media-amazon.com/images/M/MV5BOTg4ZTNkZmUtMzNlZi00YmFjLTk1MmUtNWQwNTM0YjcyNTNkXkEyXkFqcGdeQXVyNjg2NjQwMDQ@._V1_FMjpg_UX1000_.jpg",
        "spoiler": "The “twist” ending is a happy one, of course. In this alternate universe, Tate gets to raise her child; her friends will enjoy long lives; Hollywood’s innocence won’t be shattered, at least for a while longer. Plus, we all were treated to the singular catharsis of watching the brutality that the Manson crew became synonymous with get turned back around on them."
    },
    {
        "title": "For a Few Dollars More",
        "imbdRate": "8.2 / 10",
        "imgSrc": "https://m.media-amazon.com/images/M/MV5BZDJjMjM0ZGQtNzdlNS00MTRhLTg3OTYtZDc3OTgwN2Y2OGQ1XkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
        "spoiler": "Indio forces Col. Mortimer to fight a duel at a disadvantage but Joe shows up and forces Indio to play fair. Joe watches and Mortimer kills Indio. The woman from Indio's past (who killed herself) is Mortimer's sister. Mortimer lets Joe keep the bounty on Indio and his bandits. As Joe counts his winnings, and seems to be a bit short, Groggy crawls near him and tries to shoot him. Joe nonchalantly turns around and kills him."
    },
    {
        "title": "Unforgiven",
        "imbdRate": "8.2 / 10",
        "imgSrc": "https://m.media-amazon.com/images/M/MV5BODM3YWY4NmQtN2Y3Ni00OTg0LWFhZGQtZWE3ZWY4MTJlOWU4XkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_.jpg",
        "spoiler": "When the time comes to shoot Delilah's attackers, Ned realizes he's no longer capable of killing other people, forcing Munny to step in and slay one of the men for him. While Ned flees, Munny and The Schofield Kid then track down their other target, with the latter ambushing and shooting him while he's in an outhouse. It's an inglorious, horrible reality compared to whatever fantasy The Schofield Kid imagined, prompting him to admit to Munny that he never killed anyone before that and give up the gunslinger life when the pair receive their reward."
    },
    {
        "title": "The Treasure of the Sierra Madre",
        "imbdRate": "8.2/ 10",
        "imgSrc": "https://upload.wikimedia.org/wikipedia/commons/1/1d/The_Treasure_of_the_Sierra_Madre_%281947_poster%29.jpg",
        "spoiler": "Dobbs (Humphrey Bogart) is killed by the bandits. They take the donkeys and empty the bags of gold thinking that it's sand. The bandits try to sell the donkeys at the town where Dobbs, Curtin (Tim Holt) and Howard (Walter Huston) bought supplies and the donkeys when they started the search for gold. A local kid identifies the donkeys as the ones bought by the three treasure seekers and the bandits are arrested. Howard, Curtin and some of the locals (who treated Howard with great hospitality because he helped a boy who fell into a river) arrive at town and look for the bags of gold. When they see that the gold is being blown away by the wind, they laugh. Howard and Curtin go their separate ways and say good-bye to each other. Howard goes with the locals to continue living with them and Curtin goes to Dallas to pay a visit to Cody's wife."
    },
    {
        "title": "The Righteous Twelve",
        "imbdRate": "8.6 / 10",
        "imgSrc": "https://m.media-amazon.com/images/M/MV5BZjg1YjFmNWEtOTM0MC00YjcyLWIzOTQtNjE0OGY4ZWI4MTgwXkEyXkFqcGdeQXVyMzU5ODEzMDU@._V1_FMjpg_UX1000_.jpg",
        "spoiler": "In this faith-based Western, no man can escape God’s Wrath.  Twelve men come together to revenge their friend’s death but on their journey…will they find Redemption or Death?"
    },
    
    {
        "title": "Dances with Wolves",
        "imbdRate": "8 / 10",
        "imgSrc": "https://m.media-amazon.com/images/M/MV5BMTY3OTI5NDczN15BMl5BanBnXkFtZTcwNDA0NDY3Mw@@._V1_FMjpg_UX1000_.jpg",
        "spoiler": "Lt. Dunbar (Costner) returns to his post after a long stay with the Sioux, to find that the post is being occupied by Union soldiers. They mistake him for a Sioux and shoot down his horse. As they take him away to have him killed, a bunch of the soldiers shoot Two Socks, and kill him. Wind in his Hair and a few other Sioux, catches up to them. They kill the soldiers and rescue Dunbar. Dunbar warns the tribe that he is now a target to the army, and that if they find him, they will surely wipe out the tribe also. Ten Bears believes him, but assures him that he doesn't exist as Lt. John Dunbar anymore, he is known as a Sioux warrior named Dances with Wolves. The soldiers closing in, find the abandoned camp of the Sioux, if not for Dunbar, they would've all been killed. Dunbar and Stands With a Fist (McDonnell) travel back to convince the white men to make peace with the Sioux."
    },
    {
        "title": "Sholay",
        "imbdRate": "8.1 / 10",
        "imgSrc": "https://m.media-amazon.com/images/M/MV5BNDQ3ODYyOWYtYTkwNC00ZThhLTlkMzItYWMwODFhMmJhOGFlXkEyXkFqcGdeQXVyODk2ODI3MTU@._V1_.jpg",
        "spoiler": "When Basanthi is being chased by bandits, while crossing the wooden bridge she does a small stunt, she moves the horse cart and breaks down the bridge and moves ahead, so the bandits are forced to take a detour to catch her. Veeru follows them and also find the bridge broken and take a detour. Both Basanti and Veeru are caught by the bandits and Jai rescues them later. While returning after being saved by Jai from Gabbar's den, Veeru, Basanti and Jai are seen crossing the same bridge which is fully intact."
    },
    {
        "title": "The Man Who Shot Liberty Valance",
        "imbdRate": "8.1 / 10",
        "imgSrc": "https://m.media-amazon.com/images/M/MV5BMGEyNzhkYzktMGMyZS00YzRiLWJlYjktZjJkOTU5ZDY0ZGI4XkEyXkFqcGdeQXVyNjUwNzk3NDc@._V1_FMjpg_UX1000_.jpg",
        "spoiler": "The final line of The Man Who Shot Liberty Valance sees the conductor ensuring the couple of a smooth journey and stating nothing is too for the man who killed Valance. Stoddard and Hallie then sit in silence as the politician reflects on the life he built on a myth and John Wayne's Doniphon sacrificing his own happiness for him and Hallie."
    }
]
